Revit 2027 API
ExternalServices.BuiltInExternalServices.ViewSheetSetUIService Property
 The UI service which permits registration of an external server for new UI managing ViewSheetSet.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId ViewSheetSetUIService { get; }
Public Shared ReadOnly Property ViewSheetSetUIService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ ViewSheetSetUIService {
	ExternalServiceId^ get ();
}
static member ViewSheetSetUIService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace